rainer20512/stm32-fw/common/src/dev/xspi_dev.c
      return true;
    }
    static uint32_t XSpiGetClockSpeed(const HW_DeviceType *self)
    {
        switch (XSpi_GetAdditionalData(self)->clkSource) 
        {
            case RCC_QSPICLKSOURCE_D1HCLK:
                return HAL_RCC_GetHCLKFreq();
            case RCC_QSPICLKSOURCE_PLL:
                /* PLL1Q */
                return PLL_GetOutFrq(SYS_PLL1, PLL_LINE_Q)*1000;
#if defined(RCC_QSPICLKSOURCE_PLL2)
            case RCC_QSPICLKSOURCE_PLL2:
                /* PLL2R H7-devices*/
                return PLL_GetOutFrq(SYS_PLL2, PLL_LINE_R)*1000;
#endif
#if defined(RCC_QSPICLKSOURCE_CLKP)
            case RCC_QSPICLKSOURCE_CLKP:
                /* peripheral Clock, H7 devices */
                return GetPerClkFrequency();
#endif
#if defined(RCC_QSPICLKSOURCE_MSI)
            case RCC_QSPICLKSOURCE_MSI:
                /* MSI , L4+ devices */
                return HAL_RCC_MSI_Freq();
#endif
            default:
                LOG_FATAL("failed to retrieve CLK source for %s", XSpiStr);
                return 0;
       }
    }
#elif defined(STM32L4PLUS_FAMILY)
    static bool XSpiSetClockSource(const HW_DeviceType *self)
    {
      RCC_PeriphCLKInitTypeDef PeriphClkInit;

      /* QSPI/OSPI has to be operaterd with HCLK. Routines, which will set */
      /* qspi/ospi speed, rely on HCLK as Clock source                     */
      #if defined(STM32L4PLUS_FAMILY)
          /* STM32L4S devices */
          PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_OSPI; 
          PeriphClkInit.OspiClockSelection   = RCC_OSPICLKSOURCE_SYSCLK;
      #else
          /* STM32H7 devices */
          PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_QSPI; 
          PeriphClkInit.QspiClockSelection   = XSpi_GetAdditionalData(self)->clkSource;
      #endif
      if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) {
        LOG_FATAL("failed to set CLK source for %s", XSpiStr);
        return false;
      }

      return true;
    }

    static uint32_t XSpiGetClockSpeed(const HW_DeviceType *self)
    {
        switch (XSpi_GetAdditionalData(self)->clkSource) 
        {
            case RCC_OSPICLKSOURCE_SYSCLK:
                return HAL_RCC_GetHCLKFreq();
            case RCC_OSPICLKSOURCE_PLL:
                /* PLL1Q */
                return PLL_GetOutFrq(SYS_PLL1, PLL_LINE_Q)*1000;
            case RCC_OSPICLKSOURCE_MSI:
                /* MSI , L4+ devices */
                return MSI_VALUE;
            default:
                LOG_FATAL("failed to retrieve CLK source for %s", XSpiStr);
                return 0;
       }
    }
#else 
    #error "No xspi clock assignment defined"
#endif

/*
 * Init or DeInit Clock / clocksource 
 */
static bool XSpiClockInit(const HW_DeviceType *self, bool bDoInit)
{
    /* Select clock source on init*/
    if ( bDoInit ) {
        if ( !XSpiSetClockSource( (const void *)self->devBase ) ) return false;
    }

    /* Enable/Disable clock */
    HW_SetHWClock(( void *)self->devBase, bDoInit);
    return true;
}

/**************************************************************************************
 * Initialize the flash memories specific geometry data                               *
 *************************************************************************************/
void XSpi_SetGeometry ( XSpiGeometryT *geometry, uint32_t flash_size, uint32_t page_size, uint32_t sector_size )
{
    
   #if DEBUG_MODE > 0
        /* Check validity */
        #define PWROF2(a)   ( (a & (a-1)) == 0 ) 
        if ( !PWROF2(flash_size) ) {
            LOG_WARN("Flash size 0x%x is not a power of 2, sure?", flash_size);
        }
        if ( !PWROF2(page_size) ) {
            LOG_WARN("Page size 0x%x is not a power of 2, sure?", page_size);
        }
        if ( !PWROF2(sector_size) ) {
            LOG_WARN("Sector size 0x%x is not a power of 2, sure?", sector_size);
        }
   #endif

   geometry->FlashSize          = flash_size;
   geometry->ProgPageSize       = page_size;
   geometry->EraseSectorSize    = sector_size;
   geometry->ProgPagesNumber    = flash_size/page_size;
   geometry->EraseSectorsNumber = flash_size/sector_size;
}


/**************************************************************************************
 * Return the flash memories specific geometry data                               *
 *************************************************************************************/
void XSpi_GetGeometry(XSpiHandleT *myHandle, XSpiGeometryT *pInfo)
{
    memcpy(pInfo, &myHandle->geometry, sizeof(XSpiGeometryT) );
}


#if DEBUG_MODE >  0
    /**************************************************************************************
     * Return the Manufacturer Name as string                                             *
     *************************************************************************************/
    const char *XSpi_GetChipManufacturer(uint8_t mf_id )
    {
        switch(mf_id) {
            case 0x20: return "Micron"; 
            case 0xc2: return "Macronix"; 
            default:
                return "Unknown Manufacturer";
        }
    }



    /**************************************************************************************
     * Read the chip ID and print chip info. Can be used to set chip specific parameters  *
     * automatically later. Now just chip info is dumped                                  *
     *************************************************************************************/
    static void XSpi_DumpChipInfo(uint8_t *idbuf)
    {
        char type[25];
        const char *mf   =  XSpi_GetChipManufacturer(idbuf[0] );
        XSpecific_GetChipTypeText(idbuf, type, 25);
        LOG_INFO("%s: Found %s %s", XSpiStr, mf, type);
    }

    /**************************************************************************************
     * Dump the geometry data  *
     * automatically later. Now just chip info is dumped                                  *
     *************************************************************************************/
    static void XSpi_DumpGeometry(XSpiGeometryT *geo)
    {
        LOG_INFO("%s: Flash size is %dkiB", XSpiStr, geo->FlashSize>>10);
        LOG_INFO("%s: %d write pages with %d bytes", XSpiStr, geo->ProgPagesNumber, geo->ProgPageSize);
        LOG_INFO("%s: %d erase sectors with %d bytes", XSpiStr, geo->EraseSectorsNumber, geo->EraseSectorSize);
    }

#endif

/**************************************************************************************
 * Change the Qspi clock speed on the fly                                             *
 *************************************************************************************/
bool XSpi_SetSpeed (const HW_DeviceType *self, uint32_t new_clkspeed)
{
    XSpiHandleT *myHandle = XSpi_GetAdditionalData(self)->myXSpiHandle;  
    return XSpecific_BasicInit(myHandle, XSpiGetClockSpeed(self), new_clkspeed, myHandle->geometry.FlashSize, false);
}

/**************************************************************************************
 * returns value != 0, iff successfully initialized                                   *
 *************************************************************************************/
bool XSpi_IsInitialized(XSpiHandleT *myHandle)
{
    return myHandle->bIsInitialized;
}


/**************************************************************************************
 * Dump Status and restore DeepSleep-Status afterwards                                *
 *************************************************************************************/
void XSpi_DumpStatus(XSpiHandleT *myHandle)
{
    bool sleep = myHandle->dsInfo && myHandle->dsInfo->bIsDeepSleep;
    /* Wake up device, if in deep sleep */
    if ( sleep && ! XSpecific_LeaveDeepPowerDown(myHandle) ) {
        #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
            LOG_ERROR("XSpi_DumpStatus - Error: Cannot wake up flash device");
        #endif
        return;
    }

    XSpecific_DumpStatusInternal(myHandle);
    
    if ( sleep ) XSpecific_EnterDeepPowerDown(myHandle);
}

/**************************************************************************************
 * Set XSpi read, write/erase and error callbacks                                     *
 * After successful initialization, the device is deactivated to reduce power         *
 * consumption. So, to use the device, it has to be activated first                   *
 *************************************************************************************/
void XSpi_SetAsyncCallbacks(XSpiHandleT *myHandle, XSpiCallbackT rdDoneCB, XSpiCallbackT wrDoneCB, XSpiCallbackT errorCB)
{
    myHandle->XSpi_RdDoneCB  = rdDoneCB;
    myHandle->XSpi_WrDoneCB  = wrDoneCB;
    myHandle->XSpi_ErrorCB   = errorCB; 
}

