rainer20512/stm32-fw/common/src/dev/xspi_dev.c
WriteSmTerminate:
    // All erroneous exits are handeled here
    WriteEraseTerminate(false, smData.wrOpmode, smData.wrHandle);
    return false;
}

bool XSpi_WriteWait(XSpiHandleT *myHandle, uint8_t* pData, uint32_t WriteAddr, uint32_t Size) {
    if ( !WriteInit(myHandle, pData, WriteAddr, Size, XSPI_MODE_POLL, WriteSM) ) return false;
    return WriteSM();
}
bool XSpi_WriteIT  (XSpiHandleT *myHandle, uint8_t* pData, uint32_t WriteAddr, uint32_t Size) {
    if ( !WriteInit(myHandle, pData, WriteAddr, Size, XSPI_MODE_IRQ, WriteSM) ) return false;
    return WriteSM();
}
bool XSpi_WriteDMA  (XSpiHandleT *myHandle, uint8_t* pData, uint32_t WriteAddr, uint32_t Size) {
    if ( !WriteInit(myHandle, pData, WriteAddr, Size, XSPI_MODE_DMA, WriteSM) ) return false;
    return WriteSM();
}

/*-----------------------------------------------------------------------------
 * Erase - Erase - Erase - Erase - Erase - Erase - Erase - Erase - Erase - Eras
 *---------------------------------------------------------------------------*/

/******************************************************************************
 * Get the address increment depending from the erase mode
 *****************************************************************************/
static uint32_t GetEraseAddrInc(XSpiHandleT *myHandle,uint32_t erasemode)
{
    switch(erasemode)
    {
        case XSPI_ERASE_SECTOR:
            return myHandle->geometry.EraseSectorSize;
            break;
        case XSPI_ERASE_BLOCK:
            // RHB tbd return myHandle->geometry.EraseBlockSize;
            return 1 << 15;
            break;
        case XSPI_ERASE_ALL:
            return 1 << 16;
            break;
        default:
            #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
                LOGU_ERROR("GetEraseAddrInc - Error: unkown erasemode %d", erasemode);
            #endif
            ;
    }

    return 1 << 16;
}

/******************************************************************************
 * Implement a classic loop with four components
 * - Initialisation
 * - Loop body
 * - Change loop variables and check for termination
 * - terminate
 * This is done, because the loop execution is triggered direcly ( in polling mode )
 * or by interrupts ( in IRQ or DMA mode )
 *****************************************************************************/
static bool EraseInit(XSpiHandleT *myHandle, uint32_t EraseAddr, uint32_t numItems, uint32_t opmode, uint32_t erasemode, XSpi_SM_Fn stateMachine)
{
    if ( opmode != XSPI_MODE_POLL ) {
        if ( myHandle->bAsyncBusy ) {
            #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
                LOGU_ERROR("EraseInit - Error: Another Async Op is active");
            #endif
            return false;
        }
        myHandle->bAsyncBusy = true;
    }

    /* check for positive size */
    if ( numItems == 0 ) {
        #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
            LOGU_ERROR("EraseInit - Erasing 0 items not allowed");
        #endif
        return false;
    }

    /* Initialize the neccessary erase data */
    smData.currEraseAddr = EraseAddr;
    smData.EraseAddrInc  = GetEraseAddrInc(myHandle, erasemode);
    smData.EraseItemCnt  = ( erasemode == XSPI_ERASE_ALL ? 1 : numItems);
    smData.EraseMode     = erasemode;
    smData.erOpmode      = opmode;
    smData.wrOpmode    = opmode;
    smData.erState     = 0;
    smData.erHandle    = myHandle;
    erSM               = stateMachine;
    wrSM               = NULL;

    #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
        LOGU_VERBOSE("Erase Init, start: 0x%08x, itemsize=%d, items=%d, mode=%d", EraseAddr, smData.EraseAddrInc, smData.EraseItemCnt, erasemode);
    #endif

    /* Wake up device, if it has deep sleep capability and is in deep sleep */
    if ( myHandle->dsInfo && myHandle->dsInfo->bIsDeepSleep && ! XSpecific_LeaveDeepPowerDown(myHandle) ) return false;

    return true;
}

static bool WaitForEraseDone(uint32_t timeout_ms)
{
    bool ret;

    /* Configure automatic polling mode to wait for reset of WIP bit */  
    if ( smData.erOpmode == XSPI_MODE_POLL ) 
        ret = XSpecific_WaitForWriteDone(GETERHANDLE(), timeout_ms);
    else 
        ret = XSpecific_WaitForWriteDone_IT(GETERHANDLE());
 
    if ( !ret ) {
        #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
            LOGU_ERROR("QSpi_SpecificWait - Error: Timeout while autopoll");
        #endif
        return false;
    }
    
    return true;
}

static bool EraseIncement(void)
{
    /* Update the address and decrement count */
    if ( --smData.EraseItemCnt == 0 ) return false;

    smData.currEraseAddr += smData.EraseAddrInc;
    return true;
}


#define ERSTATE_START       0
#define ERSTATE_WAITFORDONE 1
#define ERSTATE_INCREMENT   2
#define ERSTATE_TERMINATE   3
#define STATE_ERROR         99

#define ER_NEXTSTATE(a)     smData.erState=a
#define ER_SM_PAUSE(a)      bSmPause=a

static bool EraseSM(void)
{
    bool bSmPause = false;
    uint32_t tmo_ms;
    uint8_t opcode_unused;

    while (!bSmPause ) {
        #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
            LOGU_VERBOSE("EraseSM in state %d", smData.erState);
        #endif
        switch ( smData.erState ) {
            case ERSTATE_START: 
                /* Enable Write and Send Erase Command - both in one step */
                LOGU_VERBOSE("Erase @0x%08x, mode=%d", smData.currEraseAddr, smData.EraseMode);
                if ( !XSpecific_EraseCMD(GETERHANDLE(), smData.currEraseAddr, smData.EraseMode) ) goto EraseSmTerminate;
                /* Continue with next state in any case*/
                ER_NEXTSTATE(ERSTATE_WAITFORDONE);
                /* Continue with waiting for completion immediately */
                ER_SM_PAUSE( false );
                break;
            case ERSTATE_WAITFORDONE:
                if ( !XSpecific_GetEraseParams(smData.EraseMode, &tmo_ms, &opcode_unused ) ) goto EraseSmTerminate;
                if ( !WaitForEraseDone(tmo_ms) ) goto EraseSmTerminate;
                LOGU_VERBOSE("Erase done");
                ER_NEXTSTATE(ERSTATE_INCREMENT);
                /* In Async mode the next state will be triggered by interrupt, proceed directly in polling mode */
                ER_SM_PAUSE( smData.erOpmode != XSPI_MODE_POLL );
                break;
            case ERSTATE_INCREMENT:
                /* increment the loop counters and check for termination */
                if ( EraseIncement() ) 
                    ER_NEXTSTATE(ERSTATE_START);
                else
                    ER_NEXTSTATE(ERSTATE_TERMINATE);
                /* Continue with next state right now*/
                ER_SM_PAUSE(false);
                break;
            case ERSTATE_TERMINATE:
                /* Final State reached without error */
                WriteEraseTerminate(true, smData.erOpmode, smData.erHandle);
                return true;
            case STATE_ERROR:
                /* Error state, reached only by error Interrupt; */
                goto EraseSmTerminate;    
            default:
                #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
                    LOGU_ERROR("EraseSM - Error: illegal state %d", smData.erState);
                #endif
                goto EraseSmTerminate;
        } // switch
    } // while
    return true;

EraseSmTerminate:
    // All erroneous exits are handeled here
    WriteEraseTerminate(false, smData.erOpmode, smData.erHandle);
    return false;
}




/* Erase <numSect> consecutive sectors, first sector specified by <EraseAddr> */
bool XSpi_EraseSectorWait       (XSpiHandleT *myHandle, uint32_t EraseAddr, uint32_t numSect)
{
    if (!EraseInit(myHandle, EraseAddr, numSect, XSPI_MODE_POLL, XSPI_ERASE_SECTOR, EraseSM )) return false;
    return EraseSM();
}
bool XSpi_EraseSectorIT         (XSpiHandleT *myHandle, uint32_t EraseAddr, uint32_t numSect)
{
    if (!EraseInit(myHandle, EraseAddr, numSect, XSPI_MODE_IRQ, XSPI_ERASE_SECTOR, EraseSM )) return false;
    return EraseSM();
}

/* Erase <numSect> consecutive block, first block specified by <EraseAddr> */
bool XSpi_EraseBlockWait        (XSpiHandleT *myHandle, uint32_t EraseAddr, uint32_t numBlock)
{
    if (!EraseInit(myHandle, EraseAddr, numBlock, XSPI_MODE_POLL, XSPI_ERASE_BLOCK , EraseSM )) return false;
    return EraseSM();
}
bool XSpi_EraseBlockIT          (XSpiHandleT *myHandle, uint32_t EraseAddr, uint32_t numBlock)
{
    if (!EraseInit(myHandle, EraseAddr, numBlock, XSPI_MODE_IRQ, XSPI_ERASE_BLOCK, EraseSM )) return false;
    return EraseSM();
}

/* Erase entire chip */
bool XSpi_EraseChipWait         (XSpiHandleT *myHandle)
{
    if (!EraseInit(myHandle, 0, 1, XSPI_MODE_POLL, XSPI_ERASE_ALL , EraseSM )) return false;
    return EraseSM();
}
bool XSpi_EraseChipIT           (XSpiHandleT *myHandle)
{
    if (!EraseInit(myHandle, 0, 1, XSPI_MODE_IRQ, XSPI_ERASE_ALL , EraseSM )) return false;
    return EraseSM();
}
#if 0
    //RHB todo

    /**
      * @brief DMA UART transmit process complete callback.
      * @param hdma DMA handle.
      * @retval None
      */
    static void XSpi_DMATransmitCplt(DMA_HandleTypeDef *hdma)
    {
      XSpiHandleT *uhandle = (XSpiHandleT *)(hdma->Parent);
      (void)(uhandle);
  
