rainer20512/stm32-fw/common/src/dev/xspi_dev.c
    #ifdef OSPI1_USE_DMA
      static DMA_HandleTypeDef hdma_ospi1;
      static const HW_DmaType dma_ospi1 = { &hdma_ospi1, OSPI1_DMA };
    #endif

    #if defined( OSPI1_USE_IRQ )
    const HW_IrqList irq_ospi1 = {
        .num = 1,
        .irq = {OSPI1_IRQ },
    };
    #endif

    /* OCTOSPI: 11 AF-Pins, NCS, CLK, DQS, SIO0, ..., SIO3, SIO4, ..., SIO7 */
    static const HW_GpioList_AF gpio_ospi1 = {
        .gpio = { 
            OSPI1_NCS, OSPI1_CLK, 
        #if defined(OSPI1_USE_DQS)
            OSPI1_DQS, 
            #define GPIO_NUM1       3
        #else
            #define GPIO_NUM1       2
        #endif
            OSPI1_SI_SIO0, OSPI1_SO_SIO1, OSPI1_SIO2, OSPI1_SIO3,
        #if defined(OSPI1_MODE_OCTO)
            OSPI1_SI_SIO4, OSPI1_SO_SIO5, OSPI1_SIO6, OSPI1_SIO7,
            #define GPIO_NUM2       8
        #else
            #define GPIO_NUM2       4
        #endif
        },
        .num = GPIO_NUM1 + GPIO_NUM2,
    };


    static const XSpi_AdditionalDataType additional_ospi1 = {
        .myXSpiHandle       = &OSpi1Handle,
        .defaultSpeed      = OSPI1_CLKSPEED,                 
        .myDsInfo           =
            #if defined(OSPI1_HAS_DS_MODE)
                &ds_ospi1,
            #else
                NULL,
            #endif
        .bHasLPMode =
            #if defined(OSPI1_HAS_LP_MODE)
                1,
            #else
                0,
            #endif
    #if USE_OSPI > 0
        .ospiMode =
            #if defined(OSPI1_MODE_OCTO)
                OSPI_OCTO,
            #elif defined(OSPI1_MODE_QUAD)
                OSPI_QUAD,
            #else
                error "Operating mode for OCTOSPI1 not set"
            #endif
        .bUseDQS =
            #if defined(OSPI1_USE_DQS)
                1,
            #else
                0,
            #endif
    #endif
    };


const HW_DeviceType HW_OSPI1 = {
    .devName        = XSpiStr,
    #if USE_QSPI > 0
        .devBase        = QUADSPI,
    #else
        #if USE_OSPI2
            .devBase        = OCTOSPI2,
        #else
            .devBase        = OCTOSPI1,
        #endif
    #endif
    .devGpioAF      = &gpio_ospi1,
    .devGpioIO      = NULL,
    .devGpioADC     = NULL,
    .devType        = HW_DEVICE_XSPI,
    .devData        = &additional_ospi1,
    .devIrqList     = 
        #if defined(OSPI1_USE_IRQ) 
            &irq_ospi1,
        #else
            NULL,
        #endif
    /* There is only one dma channel for quadspi, so we assign that  *
     * to .devDmaRx, even it's used for both directions              */
    #if defined(OSPI1_USE_DMA)
        .devDmaRx = &dma_ospi1,
    #else
        .devDmaRx   = NULL,
    #endif
    .devDmaTx       = NULL,         /* .devDmaTx  is never used */
    .Init           = XSpi_Init,
    .DeInit         = XSpi_DeInit,
    .BeforeFrqChange= XSpi_BeforeFrqChange,
    .OnFrqChange    = XSpi_OnFrqChange,
    .AllowStop      = XSpi_AllowStop,
    .OnSleep        = NULL,
    .OnWakeUp       = NULL,
};
#endif /* ( defined(QUADSPI) && defined(USE_QSPI) ) || ( defined(OCTOSPI) && defined(USE_OSPI1) ) */

#if defined(OCTOSPI2) && USE_OSPI2 > 0
    XSpiHandleT OSpi2Handle;

    #if defined(OSPI2_HAS_DS_MODE)
        static XSpiDeepSleepT ds_ospi2;
    #endif

    #ifdef OSPI2_USE_DMA
      static DMA_HandleTypeDef hdma_ospi2;
      static const HW_DmaType dma_ospi2 = { &hdma_ospi2, OSPI2_DMA };
    #endif

    #if defined( OSPI2_USE_IRQ )
    const HW_IrqList irq_ospi2 = {
        .num = 1,
        .irq = {OSPI2_IRQ },
    };
    #endif

    /* OCTOSPI: 11 AF-Pins, NCS, CLK, DQS, SIO0, ..., SIO3, SIO4, ..., SIO7 */
    static const HW_GpioList_AF gpio_ospi2 = {
        .gpio = { 
            OSPI2_NCS, OSPI2_CLK, 
        #if defined(OSPI2_USE_DQS)
            OSPI2_DQS, 
            #define GPIO_NUM1       3
        #else
            #define GPIO_NUM1       2
        #endif
            OSPI2_SI_SIO0, OSPI2_SO_SIO1, OSPI2_SIO2, OSPI2_SIO3,
        #if defined(OSPI2_MODE_OCTO)
            OSPI2_SI_SIO4, OSPI2_SO_SIO5, OSPI2_SIO6, OSPI2_SIO7,
            #define GPIO_NUM2       8
        #else
            #define GPIO_NUM2       4
        #endif
        },
        .num = GPIO_NUM1 + GPIO_NUM2,
    };


    static const XSpi_AdditionalDataType additional_ospi2 = {
        .myXSpiHandle       = &OSpi2Handle,
        .defaultSpeed      = OSPI2_CLKSPEED,                 
        .myDsInfo           =
            #if defined(OSPI2_HAS_DS_MODE)
                &ds_ospi2,
            #else
                NULL,
            #endif
        .bHasLPMode =
            #if defined(OSPI2_HAS_LP_MODE)
                1,
            #else
                0,
            #endif
    #if USE_OSPI > 0
        .ospiMode =
            #if defined(OSPI2_MODE_OCTO)
                OSPI_OCTO,
            #elif defined(OSPI2_MODE_QUAD)
                OSPI_QUAD,
            #else
                error "Operating mode for OCTOSPI2 not set"
            #endif
        .bUseDQS =
            #if defined(OSPI2_USE_DQS)
                1,
            #else
                0,
            #endif
    #endif
    };


const HW_DeviceType HW_OSPI2 = {
    .devName        = XSpiStr,
    .devBase        = OCTOSPI2,
    .devGpioAF      = &gpio_ospi2,
    .devGpioIO      = NULL,
    .devGpioADC     = NULL,
    .devType        = HW_DEVICE_XSPI,
    .devData        = &additional_ospi2,
    .devIrqList     = 
        #if defined(OSPI2_USE_IRQ) 
            &irq_ospi2,
        #else
            NULL,
        #endif
    /* There is only one dma channel for quadspi, so we assign that  *
     * to .devDmaRx, even it's used for both directions              */
    #if defined(OSPI2_USE_DMA)
        .devDmaRx = &dma_ospi2,
    #else
        .devDmaRx   = NULL,
    #endif
    .devDmaTx       = NULL,         /* .devDmaTx  is never used */
    .Init           = XSpi_Init,
    .DeInit         = XSpi_DeInit,
    .BeforeFrqChange= XSpi_BeforeFrqChange,
    .OnFrqChange    = XSpi_OnFrqChange,
    .AllowStop      = XSpi_AllowStop,
    .OnSleep        = NULL,
    .OnWakeUp       = NULL,
};
#endif /* defined(OCTOSPI2) && defined(USE_OSPI2) */



///////////////////////////////////////////////////////////////////////////////
// Interrupt routines QUADSPI /////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
#if USE_QSPI > 0 && defined(QSPI1_USE_IRQ)
    /**
      * @brief  Command completed callbacks.
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_QSPI_CmdCpltCallback(QSPI_HandleTypeDef *hxspi)
    {
        UNUSED(hxspi);
        LOGU_VERBOSE("CmdCplt Callback");
        TaskNotify(TASK_XSPI);
    }

    /**
      * @brief  Rx Transfer completed callbacks.
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_QSPI_RxCpltCallback(QSPI_HandleTypeDef *hxspi)
    {
      UNUSED(hxspi);
      LOGU_VERBOSE("RxCplt Callback");
      QSpi1Handle.bAsyncBusy = false;  
      if ( QSpi1Handle.XSpi_RdDoneCB ) QSpi1Handle.XSpi_RdDoneCB(&QSpi1Handle);
    }

    /**
      * @brief  Tx Transfer completed callbacks.
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_QSPI_TxCpltCallback(QSPI_HandleTypeDef *hxspi)
    {
        UNUSED(hxspi);
        LOGU_VERBOSE("TxCplt Callback");
        TaskNotify(TASK_XSPI);
    }

    /**
      * @brief  Status Match callbacks
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_QSPI_StatusMatchCallback(QSPI_HandleTypeDef *hxspi)
    {
        UNUSED(hxspi);
        LOGU_VERBOSE("StatusMatch Callback");
        TaskNotify(TASK_XSPI);
    }

    void HAL_QSPI_ErrorCallback(QSPI_HandleTypeDef *hxspi)
    {
      UNUSED(hxspi);
      LOGU_VERBOSE("ERROR CALLBACK");
      /* Set error state and trigger next call of SM */
      smData.wrState = STATE_ERROR;
      TaskNotify(TASK_XSPI);
    }
#endif /* USE_QSPI > 0 && defined(QSPI_USE_IRQ) */



